eisup_2019_docmng_integration/src/DataProcessors/абс_ВспомогательныеФормы/абс_ВспомогательныеФормы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ВспомогательныеФормы</name>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/Catalogs/абс_ПлановыеРегламентныеРаботы/абс_ПлановыеРегламентныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПлановыеРегламентныеРаботы</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВыполнятьРассылкуОповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/DataProcessors/абс_ВспомогательныеФормы/Forms/абс_ФормаПроверкиРегламентныхРабот/Module.bsl
&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Результат = Новый ТаблицаЗначений;
	//ОбновитьНаСервере(Результат,60);
	//Если НЕ ЗначениеЗаполнено(Результат) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(Результат = Неопределено,ВремяОтбора = 60) экспорт
	                   	
	ДатаКонтроля = ТекущаяДата();
	//Пользователь = глЗначениеПеременной("глТекущийПользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	абс_ПлановыеРегламентныеРаботы.ДатаНачала КАК ПерерывС,
	               |	абс_ПлановыеРегламентныеРаботы.ДатаОкончания КАК ПерерывПо,
	               |	абс_ПлановыеРегламентныеРаботы.Наименование КАК Событие,
	               |	абс_ПлановыеРегламентныеРаботы.ПолноеОписание,
	               |	РАЗНОСТЬДАТ(абс_ПлановыеРегламентныеРаботы.ДатаНачала, абс_ПлановыеРегламентныеРаботы.ДатаОкончания, МИНУТА) КАК ВМинутах,
	               |	РАЗНОСТЬДАТ(&ДатаНачала, абс_ПлановыеРегламентныеРаботы.ДатаНачала, МИНУТА) КАК Осталось
	               |ИЗ
	               |	Справочник.абс_ПлановыеРегламентныеРаботы КАК абс_ПлановыеРегламентныеРаботы
	               |ГДЕ
	               |	абс_ПлановыеРегламентныеРаботы.ДатаНачала >= &ДатаНачала
	               |	И абс_ПлановыеРегламентныеРаботы.ДатаОкончания <= &ДатаОкончания
	               |	И (НЕ абс_ПлановыеРегламентныеРаботы.ПометкаУдаления)
	               |	И ВЫБОР
	               |			КОГДА &ВремяОтбора = 0
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ РАЗНОСТЬДАТ(&ДатаНачала, абс_ПлановыеРегламентныеРаботы.ДатаНачала, МИНУТА) <= &ВремяОтбора
	               |		КОНЕЦ
	               |	И РАЗНОСТЬДАТ(&ДатаНачала, абс_ПлановыеРегламентныеРаботы.ДатаНачала, МИНУТА) >= 0";
				   
	Запрос.УстановитьПараметр("ДатаНачала",ДатаКонтроля);
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ДатаКонтроля));
	Запрос.УстановитьПараметр("ВремяОтбора",ВремяОтбора);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		
		 Таблица.Загрузить(Результат);
		 
		 Для каждого Строка из Результат Цикл
			Сообщить(""+Строка.Событие+" / "+Строка.ПолноеОписание+" с "+Строка.ПерерывС+" по "+Строка.ПерерывПо);	 
		 КонецЦикла; 
		 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь; 	
	ВрТекст = Элемент.ТекущиеДанные.ПолноеОписание;	
	ВвестиСтроку(ВрТекст,"Описание",,Истина);
	
КонецПроцедуры
